com.org
#+LATEX_HEADER: \usepackage{fullpage}
* introduccion
** hardware
** sofware de red
*** jerarquia de protocolos
   + organizacion por capas. cada capa tiene una funcion diferenciada e independiente
   + intercambio de mensajes segun el protocolo de cada capa
   + en realidad los mensajes bajan hasta la capa inferior (medio fisico), donde se realiza la comunicacion
   + interfaz bien definida para comunicacion entre capas
   + arquitectura de red: conjunto de capas y protocolos
   + pila de protocolos: lista de protocolos usados por una arquitectura
*** aspectos de diseño para cada capa
   + codigos de deteccion (y posible correccion) de errores
   + enrutamiento: eleccion de una ruta para enviar informacion
   + distribucion de protocolos en capas
   + mecanismos para embalar, desembalar y transmitir
   + escalabilidad
   + asignacion eficiente de recursos
   + uso del ancho de banda (multiplexado estadistico, fraccion fija)
   + control de flujo
   + confidencialidad, autenticacion e integridad
*** tipos de servicios
**** orientados a la conexion
    + se establece la conexion, se usa y se libera
    + en la mayoria de los casos se preserva el orden
    + como una linea telefonica
**** no orientados a la conexion
    + cada mensaje lleva la direccion de destino completa
    + cada mensaje es enrutado en forma independiente
    + como el sistema postal
**** confiables
    + nunca pierden datos
    + acuse de recibo
    + introduccion de sobrecarga y retardos
**** no confiables
|             | confiable             | no confiable |
| conexion    | secuencia de mensajes | voz sobre ip |
|             | flujo de bytes        |              |
| no conexion | mensajes de texto     | mails        |
*** relacion entre servicios y protocolos
   + un servicio se define como un conjunto de primitivas que una capa proporciona a la que esta encima de ella
   + el servicio define el que pero no el como
   + protocolo son las reglas de formato y significado de los paquetes o mensajes que se intercambian en la misma capa
   + servicio se relaciona con las interfaces entre capas
   + protocolo se relaciona con los paquetes que se envian entre distintas maquinas
** modelos de referencia
*** modelo osi
**** capa fisica
    + transmision de bits puros a traves de un canal de transmision
    + busca que lleguen los mismos bits que salieron
    + señales electricas para representar un bit
    + como se establece y se termina una comunicacion
**** capa de enlace de datos
    + transforma los bits puros en una linea que este libre de errores para la capa de red
    + divide los datos en tramos
    + control de transmision para emisores rapidos y receptores lentos
**** capa de red
    + como se encaminan los paquetes del origen al destino
    + las rutas se basan en tablas estaticas o dinamicas
    + manejo de congestion
    + solucionar problemas para conectar reder heterogeneas
**** capa de transporte
    + aceptar datos de la capa superior, dividirlos en unidades mas pequeñas, pasar los datos a la capa de red y asegurar que las piezas lleguen al otro extremo
    + es una verdadera capa de extremo a extremo, a diferencia de las mas bajas
**** capa de sesion
    + control de dialogo
    + manejo de tokens
    + sincronizacion
**** capa de presentacion
    + se enfoca en la sintaxis y la semantica de la informacion transmitida
    + maneja estructuras abstractas para intercambiar datos entre computadoras con diferentes representaciones de datos
**** capa de aplicacion
    + protocolos que los usuarios necesitan
*** modelo tcp/ip
**** capa de enlace
    + capa sin conexion que opera a traves de distintas redes
    + describe que enlaces se deben llevar a cabo para cumplir con las necesidades de esta capa
**** capa de interred
    + permite que los host inyecten paquetes en cualquier red y que viajen independientemente a su destino
    + analogo al sistema de correo
    + define un formato de paquete y un protocolo oficial llamado ip y uno complementario llamado icmp
    + el ruteo de paquetes es el principal aspecto, y la congestion
**** capa de transporte
    + permite que entidades en la misma capa mantengan una conversacion
    + tcp, udp
*** capa de aplicacion
    + reemplaza las capas de presentacion, sesion y aplicacion del modelo osi
    + telnet, ftp, smtp, dns, http
*** comparacion tcp/ip osi
   + osi fue inventado antes que los protocolos, por eso es mas general. pero los diseñadores no sabian que funcionalidades colocar en cada capa
   + con tcp/ip paso al reves. los protocolos encajaron perfectamente, pero no era util para describir redes que no fueran tcp/ip
   + osi tiene 7 capas, tcp/ip tiene 4
*** defectos de osi
   + mala sicronizacion: para cuando se desarrollaron los protocolos osi, tcp/ip ya se estaba usando lo suficiente como para que los distribuidores no quisieran apoyar otra pila
   + mala tecnologia: el modelo es muy complejo. las capas de sesion y presentacion estan casi vacias, las de red y enlace llenas. son dificiles de implementar e ineficientes.
   + malas implementaciones: por su complejidad las primeras implementaciones eran lentas y pesadas. despues mejoraron pero la imagen quedo
   + malas politicas: osi se asocio con el gobierno estadounidense y tcp/ip con unix
*** defectos de tcp/ip
   + no se diferencian bien los conceptos de servicio, interfaz y protocolo
   + el modelo no es para nada general
   + la capa de enlace no es una capa sino una interfaz
   + no distingue la capa de enlace y la fisica
* capa fisica
** conceptos
   + serie de fourier
   + ancho de banda
   + banda base, pasa-banda
   + teorema de nyquist, teorema de shannon
   + relacion señal ruido S/N
** medios de transmision guiados
*** medios magneticos
    + guardar la informacion en una cinta o medio removible y mandarlo fisicamente
    + /nunca subestime el ancho de banda de una camioneta repleta de cintas que viaje a toda velocidad por la carretera/
*** par trenzado
    + dos cables de cobre aislados
    + trenzados porque en paralelo forman una antena
    + la señal se transmite como la diferencia de voltaje entre los dos cables
    + el ruido afecta a los dos cables por igual, el diferencial se mantiene
    + sistema telefonico
    + informacion analogica o digital
    + el ancho de banda depende del grosor de los cables y la distancia. hasta varios mbps
    + ethernet usa cuatro, uno para cada direccion
    + hasta cat 6: utp (unshielded twisted pair). cat 7: stp
*** cable coaxial
    + mejor blindaje y mayor ancho de banda que los tp, pero mas caro
