com.tex
% Created 2021-09-20 lun 23:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fullpage}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{introduccion}
\label{sec:orgcfcc485}
\subsection{hardware}
\label{sec:org4b83ee0}
\subsection{sofware de red}
\label{sec:org6ac81c9}
\subsubsection{jerarquia de protocolos}
\label{sec:orgfe5638b}
\begin{itemize}
\item organizacion por capas. cada capa tiene una funcion diferenciada e independiente
\item intercambio de mensajes segun el protocolo de cada capa
\item en realidad los mensajes bajan hasta la capa inferior (medio fisico), donde se realiza la comunicacion
\item interfaz bien definida para comunicacion entre capas
\item arquitectura de red: conjunto de capas y protocolos
\item pila de protocolos: lista de protocolos usados por una arquitectura
\end{itemize}
\subsubsection{aspectos de diseño para cada capa}
\label{sec:org18cc93a}
\begin{itemize}
\item codigos de deteccion (y posible correccion) de errores
\item enrutamiento: eleccion de una ruta para enviar informacion
\item distribucion de protocolos en capas
\item mecanismos para embalar, desembalar y transmitir
\item escalabilidad
\item asignacion eficiente de recursos
\item uso del ancho de banda (multiplexado estadistico, fraccion fija)
\item control de flujo
\item confidencialidad, autenticacion e integridad
\end{itemize}
\subsubsection{tipos de servicios}
\label{sec:orgb35e689}
\begin{enumerate}
\item orientados a la conexion
\label{sec:org2ba7b7c}
\begin{itemize}
\item se establece la conexion, se usa y se libera
\item en la mayoria de los casos se preserva el orden
\item como una linea telefonica
\end{itemize}
\item no orientados a la conexion
\label{sec:org16d505d}
\begin{itemize}
\item cada mensaje lleva la direccion de destino completa
\item cada mensaje es enrutado en forma independiente
\item como el sistema postal
\end{itemize}
\item confiables
\label{sec:org78d48cd}
\begin{itemize}
\item nunca pierden datos
\item acuse de recibo
\item introduccion de sobrecarga y retardos
\end{itemize}
\item no confiables
\label{sec:orgc694855}
\begin{center}
\begin{tabular}{lll}
 & confiable & no confiable\\
conexion & secuencia de mensajes & voz sobre ip\\
 & flujo de bytes & \\
no conexion & mensajes de texto & mails\\
\end{tabular}
\end{center}
\end{enumerate}
\subsubsection{relacion entre servicios y protocolos}
\label{sec:orgc18edd1}
\begin{itemize}
\item un servicio se define como un conjunto de primitivas que una capa proporciona a la que esta encima de ella
\item el servicio define el que pero no el como
\item protocolo son las reglas de formato y significado de los paquetes o mensajes que se intercambian en la misma capa
\item servicio se relaciona con las interfaces entre capas
\item protocolo se relaciona con los paquetes que se envian entre distintas maquinas
\end{itemize}
\subsection{modelos de referencia}
\label{sec:org4632a9a}
\subsubsection{modelo osi}
\label{sec:orgf4c69d9}
\begin{enumerate}
\item capa fisica
\label{sec:org3b8470b}
\begin{itemize}
\item transmision de bits puros a traves de un canal de transmision
\item busca que lleguen los mismos bits que salieron
\item señales electricas para representar un bit
\item como se establece y se termina una comunicacion
\end{itemize}
\item capa de enlace de datos
\label{sec:orgd5e8763}
\begin{itemize}
\item transforma los bits puros en una linea que este libre de errores para la capa de red
\item divide los datos en tramos
\item control de transmision para emisores rapidos y receptores lentos
\end{itemize}
\item capa de red
\label{sec:orga9bcddc}
\begin{itemize}
\item como se encaminan los paquetes del origen al destino
\item las rutas se basan en tablas estaticas o dinamicas
\item manejo de congestion
\item solucionar problemas para conectar reder heterogeneas
\end{itemize}
\item capa de transporte
\label{sec:orgbd62a72}
\begin{itemize}
\item aceptar datos de la capa superior, dividirlos en unidades mas pequeñas, pasar los datos a la capa de red y asegurar que las piezas lleguen al otro extremo
\item es una verdadera capa de extremo a extremo, a diferencia de las mas bajas
\end{itemize}
\item capa de sesion
\label{sec:org77f34b5}
\begin{itemize}
\item control de dialogo
\item manejo de tokens
\item sincronizacion
\end{itemize}
\item capa de presentacion
\label{sec:orgdf509eb}
\begin{itemize}
\item se enfoca en la sintaxis y la semantica de la informacion transmitida
\item maneja estructuras abstractas para intercambiar datos entre computadoras con diferentes representaciones de datos
\end{itemize}
\item capa de aplicacion
\label{sec:orgb67022e}
\begin{itemize}
\item protocolos que los usuarios necesitan
\end{itemize}
\end{enumerate}
\subsubsection{modelo tcp/ip}
\label{sec:orgcf05cda}
\begin{enumerate}
\item capa de enlace
\label{sec:org5c05ed1}
\begin{itemize}
\item capa sin conexion que opera a traves de distintas redes
\item describe que enlaces se deben llevar a cabo para cumplir con las necesidades de esta capa
\end{itemize}
\item capa de interred
\label{sec:org52aebbc}
\begin{itemize}
\item permite que los host inyecten paquetes en cualquier red y que viajen independientemente a su destino
\item analogo al sistema de correo
\item define un formato de paquete y un protocolo oficial llamado ip y uno complementario llamado icmp
\item el ruteo de paquetes es el principal aspecto, y la congestion
\end{itemize}
\item capa de transporte
\label{sec:org4972ec9}
\begin{itemize}
\item permite que entidades en la misma capa mantengan una conversacion
\item tcp, udp
\end{itemize}
\end{enumerate}
\subsubsection{capa de aplicacion}
\label{sec:org586d88b}
\begin{itemize}
\item reemplaza las capas de presentacion, sesion y aplicacion del modelo osi
\item telnet, ftp, smtp, dns, http
\end{itemize}
\subsubsection{comparacion tcp/ip osi}
\label{sec:orgdddfaeb}
\begin{itemize}
\item osi fue inventado antes que los protocolos, por eso es mas general. pero los diseñadores no sabian que funcionalidades colocar en cada capa
\item con tcp/ip paso al reves. los protocolos encajaron perfectamente, pero no era util para describir redes que no fueran tcp/ip
\item osi tiene 7 capas, tcp/ip tiene 4
\end{itemize}
\subsubsection{defectos de osi}
\label{sec:org5a33488}
\begin{itemize}
\item mala sicronizacion: para cuando se desarrollaron los protocolos osi, tcp/ip ya se estaba usando lo suficiente como para que los distribuidores no quisieran apoyar otra pila
\item mala tecnologia: el modelo es muy complejo. las capas de sesion y presentacion estan casi vacias, las de red y enlace llenas. son dificiles de implementar e ineficientes.
\item malas implementaciones: por su complejidad las primeras implementaciones eran lentas y pesadas. despues mejoraron pero la imagen quedo
\item malas politicas: osi se asocio con el gobierno estadounidense y tcp/ip con unix
\end{itemize}
\subsubsection{defectos de tcp/ip}
\label{sec:org0da2a29}
\begin{itemize}
\item no se diferencian bien los conceptos de servicio, interfaz y protocolo
\item el modelo no es para nada general
\item la capa de enlace no es una capa sino una interfaz
\item no distingue la capa de enlace y la fisica
\end{itemize}
\section{capa fisica}
\label{sec:org80d27c0}
\subsection{conceptos}
\label{sec:org444ca46}
\begin{itemize}
\item serie de fourier
\item ancho de banda
\item banda base, pasa-banda
\item teorema de nyquist, teorema de shannon
\item relacion señal ruido S/N
\end{itemize}
\subsection{medios de transmision guiados}
\label{sec:orgf496a9c}
\subsubsection{medios magneticos}
\label{sec:org137717c}
\begin{itemize}
\item guardar la informacion en una cinta o medio removible y mandarlo fisicamente
\item \emph{nunca subestime el ancho de banda de una camioneta repleta de cintas que viaje a toda velocidad por la carretera}
\end{itemize}
\subsubsection{par trenzado}
\label{sec:org53087a0}
\begin{itemize}
\item dos cables de cobre aislados
\item trenzados porque en paralelo forman una antena
\item la señal se transmite como la diferencia de voltaje entre los dos cables
\item el ruido afecta a los dos cables por igual, el diferencial se mantiene
\item sistema telefonico
\item informacion analogica o digital
\item el ancho de banda depende del grosor de los cables y la distancia. hasta varios mbps
\item ethernet usa cuatro, uno para cada direccion
\item hasta cat 6: utp (unshielded twisted pair). cat 7: stp
\end{itemize}
\subsubsection{cable coaxial}
\label{sec:orge0a2195}
\begin{itemize}
\item mejor blindaje y mayor ancho de banda que los tp, pero mas caro
\end{itemize}
