com.org
*** multiplexacion por division de frecuencia
    + fdm: divide el espectro en bandas. cada usuario tiene posesion exclusiva de la banda
    + banda de guarda: exceso de banda que mantiene a los canales separados
    + ofdm: el ancho de banda del canal se divide en muchas subportadoras que envian de manera independiente. cada subportadora esta diseñada para ser 0 en el centro de las adyacentes. 802.11
*** multiplexacion por division de tiempo
    + tdm: los usuarios toman turnos y usan todo el ancho de banda, se toman los datos y se agregan al flujo agregado
    + para que funcione debe haber sincronizacion. se puede agregar tiempo de guarda
*** multiplexacion por division de codigo
    + cdm: forma de comunicacion de espectro diverso. una señal de banda estrecha se dispersa en una mas amplia. cdma
    + hace la señal mas tolerante a interferencias y permite que señales compartan la misma banda de frecuencia
    + cdma es extraer la señal deseada mientras lo demas se rechaza como ruido
    + cada tiempo de bit de divide en m intervalos llamados chips. en general 64 o 128 chips cada bit. a cada estacion se le asigna una secuencia de chip, un codigo de m bits. para transmitir un 1 envia la secuencia de chip, para el 0 la negacion
    + todas las secuencias de chip son ortogonales por pares
    + si varias estaciones envian al mismo tiempo se suman
* capa de enlace
** cuestiones de diseño
   + funciones: dar a la capa de red una interfaz de servicios bien definida. manejar errores. controlar flujo
   + toma los datos que obtiene de la capa de red y los encapsula en tramas
*** servicios dados a la capa de red
    + transferir datos de la maquina de origen a la de destino
    + 3 servicios razonables
     + sin conexion ni confirmacion de recepcion: tasa de error baja. trafico en tiempo real. ethernet
     + sin conexion con confirmacion: canales no confiables. 802.11 (wifi)
     + con conexion y confirmacion: cada trama esta enumerada. se garantiza que lleguen solo una vez y en orden. canales largos y no confiables. satelites y red telefonia larga
*** entramado
    + la capa fisica no garantiza que el flujo de bits este libre de errores
    + un metodo es dividir el flujo en tramas discretas y agregarles una suma de verificacion
    + division de tramas
     + conteo de bytes: agrega en el encabezado la cantidad de bytes en la trama. si se altera este valor se pierde la sincronia. rara vez se usa solo
     + bytes bandera con relleno de bytes: cada trama inicia y termina con bytes especiales. si aparece la bandera en los datos se antecede un escape. y si aparece un escape se pone otro escape adelante. simplificacion de ppp
     + bits bandera con relleno de bits: igual a bytes pero sin la restriccion de 1 byte=8 bits. hdlc. usb. se usan 6 bits en 1 para delimitar. cada vez que se ven 5 bits en 1 se agrega un 0
     + violaciones de codificacion de la capa fisica: si se usa por ejemplo 4b/5b en la capa fisica se pueden usar los codigos no utilizados para el inicio y fin de trama
*** control de errores
    + asegurar la entrega de datos confiable: retroalimentacion al emisor de lo que esta ocurriendo del otro lado. positiva y negativa
    + puede desaparecer la trama por completo, o la de retroalimentacion. para eso tambien se usan temporizadores para enviar nuevamente
    + ahora puede que se reciba la misma trama dos veces. para eso se usan numeros de secuencia
*** control de flujo
    + que hacer cuando un emisor envia mas tramas de las que el receptor puede aceptar. ejemplo telefono y sitio web
    + control de flujo basado en retroalimentacion: el receptor envia cuando puede aceptar mas datos
    + control de flujo basado en tasa: el protocolo tiene un mecanismo integrado que limita la tasa de envio
** deteccion y correccion de errores
   + estategia: incluir redundancia en los datos.
   + codigo de correccion de errores: para que el receptor pueda deducir que datos se quisieron enviar. fec
   + codigo de deteccion de errores: para que sepa que hubo un error pero nada mas y solicite retransmision
   + en fibra optica conviene la deteccion porque es rapido reenviar. en canales inalambricos es mejor correccion
   + los bits de redundancia tambien pueden llegar mal. asi que nunca se podran manejar todos los errores
   + los errores en rafaga tienen sus ventajas y desventajas
** protocolos de enlace de datos
*** paquetes sobre sonet
    + sonet se utiliza sobre canales de fibra optica de area amplia
    + ppp se usa para diferenciar paquetes ocasionales del flujo continuo en el que se transportan   
*** ppp
     + ppp orientado a bytes, hdlc a bits
     + metodo de entramado sin ambiguedades, tambien maneja deteccion de errores
     + protocolo para activar lineas, probarlas, negociar y desactivarlas. lcp
     + mecanismo para negociar opciones de capa de red independientemente del protocolo de red usado
     + uso de banderas como delimitacion y bytes de escape
     + la carga util se mezcla aleatoriamente antes de insertarla en sonet para garantizar mas transiciones que necesita sonet
     + configuracion enlace ppp
       + muerto
       + establecer (cuando hay conexion en la capa fisica): intercambio de paquetes lcp
       + autentificar (si lo anterior fue exitoso): se verifican identidades
       + red: paquetes ncp para configurar la capa de red
       + abrir: intercambio de datos
       + terminar
* subcapa control acceso al medio
  + los enlaces de red pueden ser punto a punto o difusion
  + subcapa mac es la parte inferior de la de enlace de datos
** problema de asignacion de canal
   + asignar un solo canal de difusion entre varios usuarios competidores
*** asignacion estatica
    + dividir la capacidad mediante el uso de multiplexacion. cuando hay una pequeña cantidad de usuarios constantes
    + si varia el numero de emisores y ese numero es grande se vuelve ineficiente
    + lo mismo sucede con otras formas estaticas de dividir un canal
*** supuestos para la asignacion dinamica
    + trafico independiente: las estaciones son independientes
    + canal unico: hay un solo canal para todas las comunicaciones
    + colisiones observables: todas las estaciones pueden detectar colisiones. que seran enviadas luego
    + tiempo continuo o ranurado: se puede considerar de las dos maneras
    + deteccion de portadora o sin deteccion: si hay deteccion las estaciones pueden saber si el canal esta en uso. sino mandan y despues determinan si tuvo exito
** protocolos de acceso multiple
*** aloha
    + aloha puro
      + despues de enviar su trama a la computadora central, esta difunde la trama a todas las estaciones. asi el emisor sabe si llego su trama
      + si la trama fue destruida espera un tiempo aleatorio y manda de nuevo
      + cada vez que dos tramas intenten ocupar el canal al mismo tiempo habra colision, por mas que sea un solapamiento pequeño
    + aloha ranurado
      + como el metodo puro pero el tiempo se divide en ranuras discretas
      + sincronizacion por medio de una estacion que emita una señal al comienzo de cada intervalo
