com.tex
\subsubsection{multiplexacion por division de frecuencia}
\label{sec:orge4605cc}
\begin{itemize}
\item fdm: divide el espectro en bandas. cada usuario tiene posesion exclusiva de la banda
\item banda de guarda: exceso de banda que mantiene a los canales separados
\item ofdm: el ancho de banda del canal se divide en muchas subportadoras que envian de manera independiente. cada subportadora esta diseñada para ser 0 en el centro de las adyacentes. 802.11
\end{itemize}
\subsubsection{multiplexacion por division de tiempo}
\label{sec:orgb0664b4}
\begin{itemize}
\item tdm: los usuarios toman turnos y usan todo el ancho de banda, se toman los datos y se agregan al flujo agregado
\item para que funcione debe haber sincronizacion. se puede agregar tiempo de guarda
\end{itemize}
\subsubsection{multiplexacion por division de codigo}
\label{sec:org359769a}
\begin{itemize}
\item cdm: forma de comunicacion de espectro diverso. una señal de banda estrecha se dispersa en una mas amplia. cdma
\item hace la señal mas tolerante a interferencias y permite que señales compartan la misma banda de frecuencia
\item cdma es extraer la señal deseada mientras lo demas se rechaza como ruido
\item cada tiempo de bit de divide en m intervalos llamados chips. en general 64 o 128 chips cada bit. a cada estacion se le asigna una secuencia de chip, un codigo de m bits. para transmitir un 1 envia la secuencia de chip, para el 0 la negacion
\item todas las secuencias de chip son ortogonales por pares
\item si varias estaciones envian al mismo tiempo se suman
\end{itemize}
\section{capa de enlace}
\label{sec:orgff26d6a}
\subsection{cuestiones de diseño}
\label{sec:org9b1ce65}
\begin{itemize}
\item funciones: dar a la capa de red una interfaz de servicios bien definida. manejar errores. controlar flujo
\item toma los datos que obtiene de la capa de red y los encapsula en tramas
\end{itemize}
\subsubsection{servicios dados a la capa de red}
\label{sec:org3278209}
\begin{itemize}
\item transferir datos de la maquina de origen a la de destino
\item 3 servicios razonables
\begin{itemize}
\item sin conexion ni confirmacion de recepcion: tasa de error baja. trafico en tiempo real. ethernet
\item sin conexion con confirmacion: canales no confiables. 802.11 (wifi)
\item con conexion y confirmacion: cada trama esta enumerada. se garantiza que lleguen solo una vez y en orden. canales largos y no confiables. satelites y red telefonia larga
\end{itemize}
\end{itemize}
\subsubsection{entramado}
\label{sec:org2d02fd3}
\begin{itemize}
\item la capa fisica no garantiza que el flujo de bits este libre de errores
\item un metodo es dividir el flujo en tramas discretas y agregarles una suma de verificacion
\item division de tramas
\begin{itemize}
\item conteo de bytes: agrega en el encabezado la cantidad de bytes en la trama. si se altera este valor se pierde la sincronia. rara vez se usa solo
\item bytes bandera con relleno de bytes: cada trama inicia y termina con bytes especiales. si aparece la bandera en los datos se antecede un escape. y si aparece un escape se pone otro escape adelante. simplificacion de ppp
\item bits bandera con relleno de bits: igual a bytes pero sin la restriccion de 1 byte=8 bits. hdlc. usb. se usan 6 bits en 1 para delimitar. cada vez que se ven 5 bits en 1 se agrega un 0
\item violaciones de codificacion de la capa fisica: si se usa por ejemplo 4b/5b en la capa fisica se pueden usar los codigos no utilizados para el inicio y fin de trama
\end{itemize}
\end{itemize}
\subsubsection{control de errores}
\label{sec:orgd19991d}
\begin{itemize}
\item asegurar la entrega de datos confiable: retroalimentacion al emisor de lo que esta ocurriendo del otro lado. positiva y negativa
\item puede desaparecer la trama por completo, o la de retroalimentacion. para eso tambien se usan temporizadores para enviar nuevamente
\item ahora puede que se reciba la misma trama dos veces. para eso se usan numeros de secuencia
\end{itemize}
\subsubsection{control de flujo}
\label{sec:org0c20393}
\begin{itemize}
\item que hacer cuando un emisor envia mas tramas de las que el receptor puede aceptar. ejemplo telefono y sitio web
\item control de flujo basado en retroalimentacion: el receptor envia cuando puede aceptar mas datos
\item control de flujo basado en tasa: el protocolo tiene un mecanismo integrado que limita la tasa de envio
\end{itemize}
\subsection{deteccion y correccion de errores}
\label{sec:org5baef3d}
\begin{itemize}
\item estategia: incluir redundancia en los datos.
\item codigo de correccion de errores: para que el receptor pueda deducir que datos se quisieron enviar. fec
\item codigo de deteccion de errores: para que sepa que hubo un error pero nada mas y solicite retransmision
\item en fibra optica conviene la deteccion porque es rapido reenviar. en canales inalambricos es mejor correccion
\item los bits de redundancia tambien pueden llegar mal. asi que nunca se podran manejar todos los errores
\item los errores en rafaga tienen sus ventajas y desventajas
\end{itemize}
\subsection{protocolos de enlace de datos}
\label{sec:org592bc38}
\subsubsection{paquetes sobre sonet}
\label{sec:orga7b1dfe}
\begin{itemize}
\item sonet se utiliza sobre canales de fibra optica de area amplia
\item ppp se usa para diferenciar paquetes ocasionales del flujo continuo en el que se transportan
\end{itemize}
\subsubsection{ppp}
\label{sec:org6949249}
\begin{itemize}
\item ppp orientado a bytes, hdlc a bits
\item metodo de entramado sin ambiguedades, tambien maneja deteccion de errores
\item protocolo para activar lineas, probarlas, negociar y desactivarlas. lcp
\item mecanismo para negociar opciones de capa de red independientemente del protocolo de red usado
\item uso de banderas como delimitacion y bytes de escape
\item la carga util se mezcla aleatoriamente antes de insertarla en sonet para garantizar mas transiciones que necesita sonet
\item configuracion enlace ppp
\begin{itemize}
\item muerto
\item establecer (cuando hay conexion en la capa fisica): intercambio de paquetes lcp
\item autentificar (si lo anterior fue exitoso): se verifican identidades
\item red: paquetes ncp para configurar la capa de red
\item abrir: intercambio de datos
\item terminar
\end{itemize}
\end{itemize}
\section{subcapa control acceso al medio}
\label{sec:org6f6bb49}
\begin{itemize}
\item los enlaces de red pueden ser punto a punto o difusion
\item subcapa mac es la parte inferior de la de enlace de datos
\end{itemize}
\subsection{problema de asignacion de canal}
\label{sec:org789c291}
\begin{itemize}
\item asignar un solo canal de difusion entre varios usuarios competidores
\end{itemize}
\subsubsection{asignacion estatica}
\label{sec:orgbc2ae48}
\begin{itemize}
\item dividir la capacidad mediante el uso de multiplexacion. cuando hay una pequeña cantidad de usuarios constantes
\item si varia el numero de emisores y ese numero es grande se vuelve ineficiente
\item lo mismo sucede con otras formas estaticas de dividir un canal
\end{itemize}
\subsubsection{supuestos para la asignacion dinamica}
\label{sec:org8dfa9cd}
\begin{itemize}
\item trafico independiente: las estaciones son independientes
\item canal unico: hay un solo canal para todas las comunicaciones
\item colisiones observables: todas las estaciones pueden detectar colisiones. que seran enviadas luego
\item tiempo continuo o ranurado: se puede considerar de las dos maneras
\item deteccion de portadora o sin deteccion: si hay deteccion las estaciones pueden saber si el canal esta en uso. sino mandan y despues determinan si tuvo exito
\end{itemize}
\subsection{protocolos de acceso multiple}
\label{sec:org4904b1b}
\subsubsection{aloha}
\label{sec:org9c0e35c}
\begin{itemize}
\item aloha puro
\begin{itemize}
\item despues de enviar su trama a la computadora central, esta difunde la trama a todas las estaciones. asi el emisor sabe si llego su trama
\item si la trama fue destruida espera un tiempo aleatorio y manda de nuevo
\item cada vez que dos tramas intenten ocupar el canal al mismo tiempo habra colision, por mas que sea un solapamiento pequeño
\end{itemize}
\item aloha ranurado
\begin{itemize}
\item como el metodo puro pero el tiempo se divide en ranuras discretas
\item sincronizacion por medio de una estacion que emita una señal al comienzo de cada intervalo
\end{itemize}
\end{itemize}
