com.org
*** protocolos de acceso multiple con deteccion de portadora
    + csma persistente-1
      + la estacion escucha el canal para ver si alguien esta enviando, sino envia. si ocurre una colision espera y manda de nuevo
      + el retardo de propagacion tiene un efecto importante en las colisiones. esta posibilidad depende del numero de tramas que quepan, o producto de ancho de banda-retardo
      + en lan como el retardo es pequeño, no habra muchas colisiones
    + csma no persistente
      + a diferencia del persistente-1 si el canal esta en uso espera un tiempo y repite el proceso. no se queda escuchando constantemente
      + mejor uso del canal pero mayor retardo
    + csma persistente-p
      + para canales ranurados
      + si el canal esta inactivo, envia con probabilidad p y espera a la siguiente ranura con probabilidad 1-p
    + csma con deteccion de colisiones (csma/cd)
      + base de la clasica ethernet
      + el hardware escucha a la vez que envia. si la señal que recibe es distinta a la que envia, esta ocurriendo una colision
      + periodos alternantes de contencion y transmision con periodos de inactividad que ocurriran cuando todas las estaciones esten en reposo
** protocolos libres de colisiones
*** protocolo de mapa de bits
    + cada periodo de contencion consiste en n ranuras
    + las estaciones envian 1 si tienen tramas para enviar en ese periodo pero solo en su ranura correspondiente
    + luego cuando ya hay conocimiento de quien va a mandar mandan las tramas en orden
    + protocolos de revervacion
*** paso de token
    + pasa un pequeño mensaje llamado token de una estacion a otra en un orden determinado. token ring
    + solo puede enviar la que tenga el token
    + cuando la estacion que envio recibe su misma trama la elimina para terminar el ciclo
    + no hace falta que sea un anillo. token bus
*** conteo descendente binario
    + anteriores no escalan a redes con miles de estaciones
    + las estaciones que quieren usar el canal envian su direccion binaria y hacen or de todo lo que reciben
    + tan pronto como una estacion ve que una posicion de bit de orden alto, cuya direccion es 0, ha sido sobreescrita por un 1, se da por vencida
** protocolos de contencion limitada
   + en condicion de carga ligera es preferible contencion
   + al reves para libres de colision
   + protocolos de contencion limitada combinan los dos anteriores
*** protocolo de recorrido de arbol adaptable
    + en la ranura 0 todas las estaciones intentan adquirir el canal. si una lo logra bien y sino se dividen en dos grupos y se va formando un arbol de decision
    + a mayor carga la busqueda debe iniciar mas abajo en el arbol
** protocolos de lan inalambrica
   
