com.tex
\subsubsection{protocolos de acceso multiple con deteccion de portadora}
\label{sec:orge59fe04}
\begin{itemize}
\item csma persistente-1
\begin{itemize}
\item la estacion escucha el canal para ver si alguien esta enviando, sino envia. si ocurre una colision espera y manda de nuevo
\item el retardo de propagacion tiene un efecto importante en las colisiones. esta posibilidad depende del numero de tramas que quepan, o producto de ancho de banda-retardo
\item en lan como el retardo es pequeño, no habra muchas colisiones
\end{itemize}
\item csma no persistente
\begin{itemize}
\item a diferencia del persistente-1 si el canal esta en uso espera un tiempo y repite el proceso. no se queda escuchando constantemente
\item mejor uso del canal pero mayor retardo
\end{itemize}
\item csma persistente-p
\begin{itemize}
\item para canales ranurados
\item si el canal esta inactivo, envia con probabilidad p y espera a la siguiente ranura con probabilidad 1-p
\end{itemize}
\item csma con deteccion de colisiones (csma/cd)
\begin{itemize}
\item base de la clasica ethernet
\item el hardware escucha a la vez que envia. si la señal que recibe es distinta a la que envia, esta ocurriendo una colision
\item periodos alternantes de contencion y transmision con periodos de inactividad que ocurriran cuando todas las estaciones esten en reposo
\end{itemize}
\end{itemize}
\subsection{protocolos libres de colisiones}
\label{sec:org2119d7c}
\subsubsection{protocolo de mapa de bits}
\label{sec:orgc84ca54}
\begin{itemize}
\item cada periodo de contencion consiste en n ranuras
\item las estaciones envian 1 si tienen tramas para enviar en ese periodo pero solo en su ranura correspondiente
\item luego cuando ya hay conocimiento de quien va a mandar mandan las tramas en orden
\item protocolos de revervacion
\end{itemize}
\subsubsection{paso de token}
\label{sec:org587eaae}
\begin{itemize}
\item pasa un pequeño mensaje llamado token de una estacion a otra en un orden determinado. token ring
\item solo puede enviar la que tenga el token
\item cuando la estacion que envio recibe su misma trama la elimina para terminar el ciclo
\item no hace falta que sea un anillo. token bus
\end{itemize}
\subsubsection{conteo descendente binario}
\label{sec:orge117781}
\begin{itemize}
\item anteriores no escalan a redes con miles de estaciones
\item las estaciones que quieren usar el canal envian su direccion binaria y hacen or de todo lo que reciben
\item tan pronto como una estacion ve que una posicion de bit de orden alto, cuya direccion es 0, ha sido sobreescrita por un 1, se da por vencida
\end{itemize}
\subsection{protocolos de contencion limitada}
\label{sec:orgbd65272}
\begin{itemize}
\item en condicion de carga ligera es preferible contencion
\item al reves para libres de colision
\item protocolos de contencion limitada combinan los dos anteriores
\end{itemize}
\subsubsection{protocolo de recorrido de arbol adaptable}
\label{sec:orgc9ca858}
\begin{itemize}
\item en la ranura 0 todas las estaciones intentan adquirir el canal. si una lo logra bien y sino se dividen en dos grupos y se va formando un arbol de decision
\item a mayor carga la busqueda debe iniciar mas abajo en el arbol
\end{itemize}
\subsection{protocolos de lan inalambrica}
\label{sec:org8385e23}
\end{document}